In [1]:
%matplotlib inline
import pandas as pd

In [2]:
'''from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))'''

"from IPython.core.display import HTML\ncss = open('style-table.css').read() + open('style-notebook.css').read()\nHTML('<style>{}</style>'.format(css))"

In [5]:
titles = pd.read_csv('titles.csv')
rel_dates = pd.read_csv('release_dates.csv')
cast = pd.read_csv('cast.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [6]:
titles['title'].size
# Total movies

244914

### What are the earliest two films listed in the titles dataframe?

In [7]:
sort_titles = titles.sort_values(by= ['year'])
sort_titles['title'].head(2)

193222            Miss Jerry
51388     The Startled Lover
Name: title, dtype: object

### How many movies have the title "Hamlet"?

In [8]:
len(titles[titles['title'] == 'Hamlet'])

20

### How many movies are titled "North by Northwest"?

In [9]:
len(titles[titles['title'] == 'North by Northwest'])

1

### When was the first movie titled "Hamlet" made?

In [10]:
sort_titles[sort_titles['title'] == 'Hamlet'].head(1)['year']

52521    1910
Name: year, dtype: int64

### List all of the "Treasure Island" movies from earliest to most recent.

In [11]:
sort_titles[sort_titles['title'] == 'Treasure Island']

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [12]:
sort_titles[sort_titles['year'] == 1950].shape[0]

1113

### How many movies were made in the year 1960?

In [13]:
sort_titles[sort_titles['year'] == 1960].shape[0]

1549

### How many movies were made from 1950 through 1959?

In [14]:
sort_titles[(sort_titles['year'] >= 1950) & (sort_titles['year'] <= 1959)].shape[0]

12934

### In what years has a movie titled "Batman" been released?

In [15]:
sort_titles[sort_titles['title'] == 'Batman']['year']

39349     1943
240896    1989
Name: year, dtype: int64

### How many roles were there in the movie "Inception"?

In [16]:

cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [17]:
inception = cast[cast['title']=='Inception']

In [18]:
inception.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 78 entries, 98153 to 3731263
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   title      78 non-null     object
 1   year       78 non-null     int64
 2   name       78 non-null     object
 3   type       78 non-null     object
 4   character  78 non-null     object
 5   n          51 non-null     float64
dtypes: float64(1), int64(1), object(4)
memory usage: 4.3+ KB

In [19]:
inception['character'].size

78

### But how many roles in the movie "Inception" did receive an "n" value?

In [20]:
inception['n'].isnull().sum()

27

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [22]:
north = cast[cast['title']=='North by Northwest']
notna_north = north[north['n'].notna()]
notna_north.sort_values(by= ['n']).iloc[:,2:6]

                         name     type                    character     n
871426             Cary Grant    actor           Roger O. Thornhill   1.0
3518333       Eva Marie Saint  actress                  Eve Kendall   2.0
1457165           James Mason    actor              Phillip Vandamm   3.0
3157232   Jessie Royce Landis  actress              Clara Thornhill   4.0
356707         Leo G. Carroll    actor                The Professor   5.0
3048272  Josephine Hutchinson  actress                Mrs. Townsend   6.0
1695173           Philip Ober    actor              Lester Townsend   7.0
1275337         Martin Landau    actor                      Leonard   8.0
2447081         Adam Williams    actor                     Valerian   9.0
1811387          Edward Platt    actor              Victor Larrabee  10.0
665768      Robert Ellenstein    actor                        Licht  11.0
2295714          Les Tremayne    actor                   Auctioneer  12.0
464736        Philip Coolidge    actor                    Dr. Cross  13.0
1508344         Patrick McVey    actor               Sergeant Flamm  14.0
206471           Edward Binns    actor               Captain Junket  15.0
1384780             Ken Lynch    actor  Charley - Chicago Policeman  16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [23]:
sleuth = cast[cast['title']=='Sleuth']
sleuth_1972 = sleuth[sleuth['year']==1972]
sleuth_1972.sort_values(by= ['n']).iloc[:,2:6]

                       name     type                   character    n
1705394    Laurence Olivier    actor                 Andrew Wyke  1.0
326773        Michael Caine    actor                 Milo Tindle  2.0
373876       Alec Cawthorne    actor           Inspector Doppler  3.0
1465483  John (II) Matthews    actor  Detective Sergeant Tarrant  4.0
2724553  Eve (III) Channing  actress             Marguerite Wyke  5.0
1448690        Teddy Martin    actor      Police Constable Higgs  6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [24]:
sleuth_2007 = sleuth[sleuth['year']==2007]
sleuth_2007.sort_values(by= ['n']).iloc[:,2:6]

                        name     type          character    n
326774         Michael Caine    actor             Andrew  1.0
1293634             Jude Law    actor               Milo  2.0
1805907        Harold Pinter    actor        Man on T.V.  3.0
260242       Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [27]:
len(cast[(cast.title == 'Hamlet') & (cast.year == 1921)].character)

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [28]:
len(cast[(cast.title == 'Hamlet') & (cast.year == 1996)].character)

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [29]:
len(cast[(cast.character == 'Hamlet')])

96

### How many people have played an "Ophelia"?

In [30]:
len(cast[(cast.character == 'Ophelia')].name)

117

### How many people have played a role called "The Dude"?

In [31]:

len(cast[(cast.character == 'The Dude')])

19

### How many people have played a role called "The Stranger"?

In [32]:
len(cast[(cast.character == 'The Stranger')])

212

### How many roles has Sidney Poitier played throughout his career?

In [33]:
len(cast[(cast.name == 'Sidney Poitier')])

43

### How many roles has Judi Dench played?

In [34]:
len(cast[(cast.name == 'Judi Dench')])

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [35]:

cast[(cast.name == 'Cary Grant') & (cast.year>=1940) & (cast.year<1950) & (cast.n==2)].sort_values(by= ['year'])[['year','name','character']]

        year        name    character
871423  1940  Cary Grant   Nick Arden
871433  1941  Cary Grant  Roger Adams

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [36]:
cast[(cast.name == 'Cary Grant') & (cast.year>=1940) & (cast.year<1950) & (cast.n==1)].sort_values(by= ['year'])[['year','name','character']]

        year        name                             character
871448  1940  Cary Grant                           Matt Howard
871407  1940  Cary Grant                          Walter Burns
871450  1940  Cary Grant                    C. K. Dexter Haven
871438  1941  Cary Grant                      Johnnie Aysgarth
871452  1942  Cary Grant                          Leopold Dilg
871429  1942  Cary Grant                 Patrick 'Pat' O'Toole
871398  1943  Cary Grant                         Capt. Cassidy
871422  1943  Cary Grant  Joe Adams -posing as Joe Bascopolous
871430  1944  Cary Grant                           Jerry Flynn
871390  1944  Cary Grant                     Mortimer Brewster
871425  1944  Cary Grant                            Ernie Mott
871424  1946  Cary Grant                           Cole Porter
871427  1946  Cary Grant                                Devlin
871444  1947  Cary Grant                           Dick Nugent
871445  1947  Cary Grant                                Dudley
871421  1948  Cary Grant                         Jim Blandings
871402  1948  Cary Grant                     Dr. Madison Brown
871411  1949  Cary Grant                 Captain Henri Rochard

### How many roles were available for actors in the 1950s?

In [37]:
len(cast[(cast.type == 'actor') & ((cast.year>=1950) & (cast.year<1960))].character)

157738

### How many roles were available for actresses in the 1950s?

In [38]:
len(cast[(cast.type == 'actress') & ((cast.year>=1950) & (cast.year<1960))].character)

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [39]:
len(cast[(cast.n==1) & (cast.year<=1980)].character)

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [40]:
len(cast[(cast.n!=1) & (cast.year<=1980)].character)

1117667

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [41]:
len(cast[(cast.n.isna()) & (cast.year<=1980)].character)

448347